In [1]:
import pandas as pd

In [2]:
data = { 'city': ['Mumbai','Mumbai','Mumbai','Hydrabad','Hydrabad','Hydrabad'] ,
        'year': [2010,2011,2012,2010,3011,2012],
         'population': [10.0,10.1,10.2,5.2,5.3,5.5]}

In [3]:
data

{'city': ['Mumbai', 'Mumbai', 'Mumbai', 'Hydrabad', 'Hydrabad', 'Hydrabad'],
 'year': [2010, 2011, 2012, 2010, 3011, 2012],
 'population': [10.0, 10.1, 10.2, 5.2, 5.3, 5.5]}

In [4]:
df1 = pd.DataFrame(data)

In [5]:
df1

       city  year  population
0    Mumbai  2010        10.0
1    Mumbai  2011        10.1
2    Mumbai  2012        10.2
3  Hydrabad  2010         5.2
4  Hydrabad  3011         5.3
5  Hydrabad  2012         5.5

In [6]:
df2 = pd.DataFrame(data,columns=['year','city','population'])

In [7]:
df2

   year      city  population
0  2010    Mumbai        10.0
1  2011    Mumbai        10.1
2  2012    Mumbai        10.2
3  2010  Hydrabad         5.2
4  3011  Hydrabad         5.3
5  2012  Hydrabad         5.5

In [9]:
df3 = pd.DataFrame(data,columns=['year','city','population','gdp'], index=['one','two','three','four','five','six'])

In [10]:
df3

       year      city  population  gdp
one    2010    Mumbai        10.0  NaN
two    2011    Mumbai        10.1  NaN
three  2012    Mumbai        10.2  NaN
four   2010  Hydrabad         5.2  NaN
five   3011  Hydrabad         5.3  NaN
six    2012  Hydrabad         5.5  NaN

In [11]:
df3.year

one      2010
two      2011
three    2012
four     2010
five     3011
six      2012
Name: year, dtype: int64

In [12]:
df3.year.dtype

dtype('int64')

In [16]:
df3.dtypes

year            int64
city           object
population    float64
gdp            object
dtype: object

In [18]:
df3.loc['one']

year            2010
city          Mumbai
population        10
gdp              NaN
Name: one, dtype: object

In [19]:
df3.loc['four']

year              2010
city          Hydrabad
population         5.2
gdp                NaN
Name: four, dtype: object

In [20]:
df3.gdp=10

In [21]:
df3

       year      city  population  gdp
one    2010    Mumbai        10.0   10
two    2011    Mumbai        10.1   10
three  2012    Mumbai        10.2   10
four   2010  Hydrabad         5.2   10
five   3011  Hydrabad         5.3   10
six    2012  Hydrabad         5.5   10